Revit 2027 API
SaveOptions.Compact Property
 Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Compact { get; set; }
Public Property Compact As Boolean
	Get
	Set
public:
property bool Compact {
	bool get ();
	void set (bool value);
}
member Compact : bool with get, set
Property Value
Boolean
See Also
Reference
SaveOptions Class
Autodesk.Revit.DB Namespace